use-case-3-appd-load-test/histogram-customers/j-artillery.yaml

apiVersion: batch/v1
kind: Job
metadata:
  name: artillery
  labels:
    app: artillery
spec:
  completions: 1
  backoffLimit: 0
  template:
    metadata:
      labels:
        app: artillery
    spec:
      restartPolicy: Never
      containers:
      - name: artillery
        image: artilleryio/artillery:latest
        command:
        - /home/node/artillery/bin/run
        - run
        - /opt/artillery/loadtest.yaml
        imagePullPolicy: Always
        volumeMounts:
        - name: loadtest-config
          readOnly: true
          mountPath: /opt/artillery/loadtest.yaml
          subPath: loadtest.yaml
      volumes:
        - name: loadtest-config
          configMap:
            name: loadtest-config
            items:
              - key: loadtest.yaml
                path: loadtest.yaml
            defaultMode: 420

---
apiVersion: v1
kind: ConfigMap
metadata:
  name: loadtest-config
data:
  loadtest.yaml: |
    config:
      target: http://customers.demo.svc.cluster.local:8282
      phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 5
          name: Warm up phase
        - duration: 60
          arrivalRate: 5
          rampTo: 10
          name: Ramp up load
        - duration: 30
          arrivalRate: 10
          rampTo: 30
          name: Spike phase
      # Load & configure a couple of useful plugins
      # https://docs.art/reference/extensions
      plugins:
        ensure: {}
        apdex: {}
        metrics-by-endpoint: {}
      apdex:
        threshold: 100
      ensure:
        thresholds:
          - http.response_time.p99: 10000
          - http.response_time.p95: 9000
      variables:
        customer:
          - "cisco"
          - "adidas"
        order:
          - "3001"
          - "3002"
          - "3003"
          - "3004"
          - "3005"
          - "3006"
          - "3007"
          - "3008"
          - "3009"
          - "3010"
    scenarios:
      - flow:
          - loop:
            - get:
                url: "/api/customer/{{customer}}/order/{{order}}"
            count: 30